---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MassDataShadeDepth
source: html/8a3b24e9-d079-f69c-8d8b-9c5deab01af4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MassDataShadeDepth Property

"Shade Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId MassDataShadeDepth { get; }
```